{
  "durationMilliseconds": 435069,
  "combinedPhrases": [
    {
      "text": "I've had people on this podcast sit where you're sitting and basically paint a picture of sugar that it is not quite as bad as crack cocaine and meth, but not too far from that, kind of exaggerating. And I've had people who land in the more kind of tempered response to sugar, but let's define sugar. We're not talking, when I say sugar, I'm not talking about fructose in fruit, because in fruit you've got fructose, but you've got fiber and there's a high water content. And some, sure, some fruits have higher fructose content than others, mangoes versus apples, for instance, or something of that sort. But when I'm talking about sugar, I'm talking about if one looks at a package or a label and sees added sugars, How bad are added sugars? Because those are really the ones that tend to, fall into this bin of quote unquote bad sugar in a lot of people's minds. Okay, so they dilute the nutritive value of the diet and they contribute to hyper palatability. If you're talking about extrinsic sugars added to the diet, you know, they're only really only two sources of intrinsic sugars are in fruit and in milk. Everything else, you're pretty much adding it. The exception of like maybe agave, but that's kind of a rare esoteric thing. But added sugars to the diet should be consumed judiciously. The working recommendation is to try to limit added sugars to the diet to 10% of total calories. So if you're somebody who likes to put maple syrup on whatever you might do, or somebody who likes to put honey on whatever you might do, then you may want to limit that to a typical, let's say, 2,000 calorie diet. You might want to limit it to like a maximum of 40, 50 grams A day. That still seems high. It does. 40, 50 grams. Who's eating that much sugar? If that me. Oh, really? You have a sweet tooth? No, I love honey and I love maple syrup. I have a savory tooth. Like if I have to try and not eat the entire block of Parmesan cheese. I have both, man. I always joke that I have an inner fat boy within me, but I actually have been technically obese by BMI standards like 10 years-ish back. You're how old now? 53. Great. Well, you seem to be in great shape. No hormone augmentation. We clarified that earlier. I asked. This is what guys ask each other nowadays. Are you doing any hormone augmentation? No. So Alan says no, and I believe him completely. But yeah, you're in great shape at 53. Thank you. And you have a sweet tooth and a savory tooth. I do, man. So how do you contend with it? I do. Oh, okay. So that's a great question because I can dish out something practical here. Protein powder. Protein powder satisfies the heck out of my sweet tooth. And I actually don't have the full 50 grams of added sugar. I might add like a tablespoon of maple syrup to my coffee. To the coffee. In the day. Yeah. Dude. Okay. So you know those mocha mocha pot thingies? Mocha pot. Sorry. It's like some. It's a piece of hardware. Yeah, It's the thing where you, it's this odd, like. Oh, right, it's like an hourglass shaped coffee bus. Yes. Okay. So I have that. And what I'm trying to do, I'm trying to duplicate the Thai coffee. Is it Thai? What is it? It's really freaking good coffee that either Vietnamese coffee. Vietnamese coffee. Yeah, I love Vietnamese food. I don't drink the Vietnamese coffee. It's too sweet for me. Dude, I'm trying to do a version of that with the moka pot. And if I put maple syrup in that tablespoon, it's freaking awesome. And I have that with half and half. It's really good. So you got a fat sugar combination plus caffeine. You do this in the morning before you train? I've been doing it. I go through these phases, but I have that. And so the extent of added sugar in my diet is that tablespoon of maple syrup. So you know what, I do agree with you. 50 grams could be a little bit up there. Listen, I'm not here to judge. Like I said, if I had a sweet tooth, what's interesting, I used to have one. I lost it. over the course of about a decade. I used to love like sour patch gummies and gummies and I love gummy, I love fruity taste and that kind of thing. I lost it by doing something that probably has no scientific basis. But I heard years ago that if I took a teaspoon of L-glutamine, and put it in high fat, in half and half, in cream basically, and took a shot of that twice a day that it would kill my sugar cravings. And I did that and it weaned me off sugar and then I increased my protein intake. So it could have been any combination of things or it could be total placebo. I mean, so I want to acknowledge that. Although I've recommended this to some self-professed sugar addicts. Okay. And they're like, yeah, it kills the sugar craving, but then they always add the, but I still miss my, whatever. They long for the sugary thing. I don't any longer. This is where I headed off the sweet stuff. I make protein smoothies and they're just, they're artificially sweetened. So it satisfies that that dessert craving, if you will. Well, along the lines of artificial sweeteners, why, if you want something sweet, wouldn't you just replace the honey with like stevia? Because it doesn't create the same satiety that the maple syrup does for you. Oh, man. Okay, so maple syrup aside, the, you get caloric savings, you know, if your protein powder is artificially sweetened, let's say, with stevia or sucralose or monk fruit or whatever is being used in the product. You get caloric savings and you just kind of get the macro savings, if you will, as well. And so protein powders are like, I mean, in my opinion, they're just such a breakthrough. because they satisfy the protein requirements or they significantly augment the protein requirements and they take care of essentially having something that is the experience of a dessert to me anyway. I make some really good fruit smoothies. I use frozen fruit, protein powder. Sometimes I do like a mocha type of smoothie. Sometimes I do like a tropical fruit type of smoothie. It's like a milkshake. Yeah, it is like a milkshake, right?"
    }
  ],
  "phrases": [
    {
      "speaker": 1,
      "offsetMilliseconds": 2480,
      "durationMilliseconds": 21920,
      "text": "I've had people on this podcast sit where you're sitting and basically paint a picture of sugar that it is not quite as bad as crack cocaine and meth, but not too far from that, kind of exaggerating. And I've had people who land in the more kind of tempered response to sugar, but let's define sugar.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 25920,
      "durationMilliseconds": 26720,
      "text": "We're not talking, when I say sugar, I'm not talking about fructose in fruit, because in fruit you've got fructose, but you've got fiber and there's a high water content. And some, sure, some fruits have higher fructose content than others, mangoes versus apples, for instance, or something of that sort. But when I'm talking about sugar, I'm talking about if one looks at a package or a label and sees added sugars,",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 53760,
      "durationMilliseconds": 9200,
      "text": "How bad are added sugars? Because those are really the ones that tend to, fall into this bin of quote unquote bad sugar in a lot of people's minds.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 64120,
      "durationMilliseconds": 18280,
      "text": "Okay, so they dilute the nutritive value of the diet and they contribute to hyper palatability. If you're talking about extrinsic sugars added to the diet, you know, they're only really only two sources of intrinsic",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 83440,
      "durationMilliseconds": 27120,
      "text": "sugars are in fruit and in milk. Everything else, you're pretty much adding it. The exception of like maybe agave, but that's kind of a rare esoteric thing. But added sugars to the diet should be consumed judiciously. The working recommendation is to try to limit added sugars to the diet to",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 111080,
      "durationMilliseconds": 17840,
      "text": "10% of total calories. So if you're somebody who likes to put maple syrup on whatever you might do, or somebody who likes to put honey on whatever you might do, then you may want to limit that to a typical, let's say, 2,000 calorie diet. You might want to limit it to like a maximum of 40, 50 grams A day.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 128920,
      "durationMilliseconds": 1880,
      "text": "That still seems high.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 130960,
      "durationMilliseconds": 480,
      "text": "It does.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 131880,
      "durationMilliseconds": 3320,
      "text": "40, 50 grams. Who's eating that much sugar?",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 135200,
      "durationMilliseconds": 560,
      "text": "If that me.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 136320,
      "durationMilliseconds": 1160,
      "text": "Oh, really? You have a sweet tooth?",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 137760,
      "durationMilliseconds": 2480,
      "text": "No, I love honey and I love maple syrup.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 140800,
      "durationMilliseconds": 6160,
      "text": "I have a savory tooth. Like if I have to try and not eat the entire block of Parmesan cheese.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 147520,
      "durationMilliseconds": 11760,
      "text": "I have both, man. I always joke that I have an inner fat boy within me, but I actually have been technically obese by BMI standards like 10 years-ish back.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 159440,
      "durationMilliseconds": 2400,
      "text": "You're how old now? 53.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 162320,
      "durationMilliseconds": 17440,
      "text": "Great. Well, you seem to be in great shape. No hormone augmentation. We clarified that earlier. I asked. This is what guys ask each other nowadays. Are you doing any hormone augmentation? No. So Alan says no, and I believe him completely. But yeah, you're in great shape at 53. Thank you. And you have a sweet tooth and a savory tooth.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 179760,
      "durationMilliseconds": 760,
      "text": "I do, man.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 180520,
      "durationMilliseconds": 920,
      "text": "So how do you contend with it?",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 181440,
      "durationMilliseconds": 6560,
      "text": "I do. Oh, okay. So that's a great question because I can dish out something practical here. Protein powder.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 188880,
      "durationMilliseconds": 21920,
      "text": "Protein powder satisfies the heck out of my sweet tooth. And I actually don't have the full 50 grams of added sugar. I might add like a tablespoon of maple syrup to my coffee. To the coffee. In the day. Yeah. Dude. Okay. So you know those mocha mocha pot thingies? Mocha pot. Sorry.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 211320,
      "durationMilliseconds": 680,
      "text": "It's like some.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 212240,
      "durationMilliseconds": 1280,
      "text": "It's a piece of hardware.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 214040,
      "durationMilliseconds": 4920,
      "text": "Yeah, It's the thing where you, it's this odd, like.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 219200,
      "durationMilliseconds": 3120,
      "text": "Oh, right, it's like an hourglass shaped coffee bus.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 222320,
      "durationMilliseconds": 640,
      "text": "Yes.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 223160,
      "durationMilliseconds": 160,
      "text": "Okay.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 223920,
      "durationMilliseconds": 8880,
      "text": "So I have that. And what I'm trying to do, I'm trying to duplicate the Thai coffee. Is it Thai?",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 233760,
      "durationMilliseconds": 5840,
      "text": "What is it? It's really freaking good coffee that either Vietnamese coffee. Vietnamese coffee.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 239680,
      "durationMilliseconds": 3440,
      "text": "Yeah, I love Vietnamese food. I don't drink the Vietnamese coffee. It's too sweet for me.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 243560,
      "durationMilliseconds": 10920,
      "text": "Dude, I'm trying to do a version of that with the moka pot. And if I put maple syrup in that tablespoon, it's freaking awesome. And I have that with half and half. It's really good.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 255600,
      "durationMilliseconds": 4800,
      "text": "So you got a fat sugar combination plus caffeine. You do this in the morning before you train?",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 260880,
      "durationMilliseconds": 12160,
      "text": "I've been doing it. I go through these phases, but I have that. And so the extent of added sugar in my diet is that tablespoon of maple syrup. So you know what, I do agree with you. 50 grams could be a little bit up there.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 273280,
      "durationMilliseconds": 7200,
      "text": "Listen, I'm not here to judge. Like I said, if I had a sweet tooth, what's interesting, I used to have one. I lost it.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 281280,
      "durationMilliseconds": 18480,
      "text": "over the course of about a decade. I used to love like sour patch gummies and gummies and I love gummy, I love fruity taste and that kind of thing. I lost it by doing something that probably has no scientific basis. But I heard years ago that if I took a teaspoon of L-glutamine,",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 300320,
      "durationMilliseconds": 23840,
      "text": "and put it in high fat, in half and half, in cream basically, and took a shot of that twice a day that it would kill my sugar cravings. And I did that and it weaned me off sugar and then I increased my protein intake. So it could have been any combination of things or it could be total placebo. I mean, so I want to acknowledge that. Although I've recommended this to some",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 324560,
      "durationMilliseconds": 1920,
      "text": "self-professed sugar addicts.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 326560,
      "durationMilliseconds": 240,
      "text": "Okay.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 326960,
      "durationMilliseconds": 10040,
      "text": "And they're like, yeah, it kills the sugar craving, but then they always add the, but I still miss my, whatever. They long for the sugary thing. I don't any longer.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 337000,
      "durationMilliseconds": 12760,
      "text": "This is where I headed off the sweet stuff. I make protein smoothies and they're just, they're artificially sweetened. So it satisfies that",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 350480,
      "durationMilliseconds": 1760,
      "text": "that dessert craving, if you will.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 352640,
      "durationMilliseconds": 15920,
      "text": "Well, along the lines of artificial sweeteners, why, if you want something sweet, wouldn't you just replace the honey with like stevia? Because it doesn't create the same satiety that the maple syrup does for you.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 369960,
      "durationMilliseconds": 9720,
      "text": "Oh, man. Okay, so maple syrup aside, the, you get caloric savings, you know, if your protein powder is",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 380000,
      "durationMilliseconds": 21760,
      "text": "artificially sweetened, let's say, with stevia or sucralose or monk fruit or whatever is being used in the product. You get caloric savings and you just kind of get the macro savings, if you will, as well. And so protein powders are like, I mean, in my opinion, they're just such a breakthrough.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 402240,
      "durationMilliseconds": 22000,
      "text": "because they satisfy the protein requirements or they significantly augment the protein requirements and they take care of essentially having something that is the experience of a dessert to me anyway. I make some really good fruit smoothies. I use frozen fruit, protein powder. Sometimes I do like a mocha type of smoothie. Sometimes I do like a tropical fruit type of smoothie.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 1,
      "offsetMilliseconds": 424240,
      "durationMilliseconds": 560,
      "text": "It's like a milkshake.",
      "locale": "en-US",
      "confidence": 0
    },
    {
      "speaker": 2,
      "offsetMilliseconds": 425120,
      "durationMilliseconds": 1760,
      "text": "Yeah, it is like a milkshake, right?",
      "locale": "en-US",
      "confidence": 0
    }
  ]
}